/*                       计算机硬件组成
*（一）.CPU，中央处理器（central processing unit），是电子计算机的主要设备之一
* 作为计算机系统的运算和控制核心，是信息处理，程序运行的最终执行单元
*
* cpu的相关参数：主频，外频，前端总线（FSB）频率，缓存等
* 1.主频，也叫时钟频率，单位是兆赫（MHz）或千兆赫（GHz，10亿个信号）是cpu的于是暖、处理速度的主要体现
* 2.外频，是cpu的基准频率，单位是MHz。是cpu和主板之间同步运行的速度，外频决定着整块主板的运行速度
* 3.前端总线（FSB）频率：直接影响cpu与内存直接数据交换速度。cpu算完了，要把结果传给内存了，两者之间的传输速度
* 4.缓存：缓存容量的增大，可以大幅提升cpu内部读取数据的命中率，而不用再到内存或者硬盘上面寻找，以此提高系统性能
*
*（二）.主板，是电脑各个配件的连接平台，分为大中小三种。电脑中的其他配件，比如内存，cpu等哦都需要查到主办的特定的插槽中才能使用。
*（三）.内存：临时存储数据，断电就不存储
*（四）.硬盘：是一种最为常见的外存储器，存储在硬盘中的数据可以永久化存储。保存到硬盘：写数据（磁盘）。打开文件：读取数据（磁头）。
* 1.容量：硬盘能存储多少数据
* 2.单碟容量：
* 3.转速：中间盘片马达的转动速度
*（五）.显卡：把存储的数字信息变成图片或者视频等数据，交给显示器显示出来。
*（六）.显示器：2K：1920x1080，1998x1080,2048x1080,2048x858
*  4k:3840x2160,3996x2160,4096x2160,4096x1716     这里的k只是类别，不是具体数据。
* 这边的多少x多少，就是长/宽多少个像素点
* 光学三原色：红绿蓝
*
* */