//                 计算机软件+上网分析
//计算机软件
//1.系统软件
//居于计算机系统中最靠近硬件的一层，其他软件一般通过系统软件发挥作用
//可分为：操作系统，语言处理系统，数据库管理系统，软件工具等

//2.应用软件
//特定领域专用的软件。基本上我们自己安装的所有软件，都是应用软件



//上网分析
//（1）C/S架构：（Client和Server，客户端和服务器端），如QQ，迅雷，lol
//优点：用户体验好。    缺点：开发、安装、部署、维护麻烦
//因为页面效果已经提前存储在计算机中了

//（2）B/S架构（Browser和Server浏览器和服务器端）所有的网站，狗东，某宝等
//优点：开发，安装，部署，维护简单   缺点：1.如果应该用过大，用户体验可能受到影响 2.对硬件要求过高
//因为所有的页面效果都是从服务器端发送到浏览器的

//C/S和B/S的对比；
//1.BS中，在你没网的时候，打开浏览器是不会显示页面的
//  而在CS中，打开客户端，即使没网，最开始的登录界面还是可以打开，但是不能成功登录
//2.CS架构：交互性强、具有安全的存取模式、网络通信量低、响应速度快、利于处理大量数据，在客户端可以展示很复杂的页面效果
//  它充分利用两端硬件，将任务分配道Client和Server两端，降低了系统别的通讯开销
//3.BS架构：维护方便、开发简单且共享性强，成本低
//  对服务器要求过高，传输数据慢，很难实现复杂的页面效果

//前端：浏览器（B/S)、app、客户端(C/S)（直接跟用户接触的）
//后端：服务器（互联网公司的）


